; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_3 type_1)
 (:predicates (pred_3 ?v6 - type_3 ?v7 - type_2)
 	      (pred_4 ?v5 - object ?v7 - type_2)
	      (pred_1 ?v6 - type_3 ?v1 - type_1)
	      (pred_2 ?v6 - type_3 ?v5 - object ?v1 - type_1))

   (:action op_2
       :parameters  (?v6 - type_3 ?v3 ?v8 - type_2)
       :precondition (and  (pred_3 ?v6 ?v3))
       :effect (and  (pred_3 ?v6 ?v8)
		     (not (pred_3 ?v6 ?v3))))

   (:action op_3
       :parameters (?v6 - type_3 ?v4 - object ?v2 - type_2 ?v1 - type_1)
       :precondition  (and  (pred_4 ?v4 ?v2) (pred_3 ?v6 ?v2) (pred_1 ?v6 ?v1))
       :effect (and (pred_2 ?v6 ?v4 ?v1)
		    (not (pred_4 ?v4 ?v2)) 
		    (not (pred_1 ?v6 ?v1))))

   (:action op_1
       :parameters (?v6 - type_3 ?v4 - object ?v2 - type_2 ?v1 - type_1)
       :precondition  (and  (pred_2 ?v6 ?v4 ?v1) (pred_3 ?v6 ?v2))
       :effect (and (pred_4 ?v4 ?v2)
		    (pred_1 ?v6 ?v1)
		    (not (pred_2 ?v6 ?v4 ?v1)))))

; problem
(define (problem gripper-1-4-3)
(:domain gripper-strips)
(:objects obj_01 - type_3
obj_07 obj_09 - type_1
obj_02 obj_03 obj_04 obj_06 - type_2
obj_05 obj_08 obj_10 - object)
(:init
(pred_3 obj_01 obj_06)
(pred_1 obj_01 obj_07)
(pred_1 obj_01 obj_09)
(pred_4 obj_05 obj_06)
(pred_4 obj_08 obj_04)
(pred_4 obj_10 obj_02)
)
(:goal
(and
(pred_4 obj_05 obj_03)
(pred_4 obj_08 obj_02)
(pred_4 obj_10 obj_02)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_2 obj_01 ?b obj_07))))
)
)

; plan
1. (op_3 obj_01 obj_05 obj_06 obj_09)
   deleted: (pred_4 obj_05 obj_06) (pred_1 obj_01 obj_09)
   added: (pred_2 obj_01 obj_05 obj_09)
   goals met: 1 of 3
2. (op_2 obj_01 obj_06 obj_04)
   deleted: (pred_3 obj_01 obj_06)
   added: (pred_3 obj_01 obj_04)
   goals met: 1 of 3
3. (op_2 obj_01 obj_04 obj_03)
   deleted: (pred_3 obj_01 obj_04)
   added: (pred_3 obj_01 obj_03)
   goals met: 1 of 3
4. (op_1 obj_01 obj_05 obj_03 obj_09)
   deleted: (pred_2 obj_01 obj_05 obj_09)
   added: (pred_4 obj_05 obj_03) (pred_1 obj_01 obj_09)
   goals met: 2 of 3
5. (op_2 obj_01 obj_03 obj_04)
   deleted: (pred_3 obj_01 obj_03)
   added: (pred_3 obj_01 obj_04)
   goals met: 2 of 3
6. (op_3 obj_01 obj_08 obj_04 obj_09)
   deleted: (pred_4 obj_08 obj_04) (pred_1 obj_01 obj_09)
   added: (pred_2 obj_01 obj_08 obj_09)
   goals met: 2 of 3
7. (op_2 obj_01 obj_04 obj_02)
   deleted: (pred_3 obj_01 obj_04)
   added: (pred_3 obj_01 obj_02)
   goals met: 2 of 3
8. (op_1 obj_01 obj_08 obj_02 obj_09)
   deleted: (pred_2 obj_01 obj_08 obj_09)
   added: (pred_4 obj_08 obj_02) (pred_1 obj_01 obj_09)
   goals met: 3 of 3
